{"meta":{"title":"My Sharepoint and Web Development musings","subtitle":"This is where I share whatever knowledge I have about Sharepoint, VueJS and any other topic","description":"","author":"Imanol Nebreda","url":"https://blog.imanolnebreda.com","root":"/"},"pages":[{"title":"Sobre mí / About me","date":"2020-03-15T15:08:07.000Z","updated":"2020-03-15T15:08:07.000Z","comments":true,"path":"about/index.html","permalink":"https://blog.imanolnebreda.com/about/","excerpt":"","text":"Software Development Engineer at Plain ConceptsMadrid y alrededores, EspañaAcerca de10+ años de experiencia en Sharepoint (2007/2010/2013/2016/Online) con Nintex, K2, frameworks JavaScript (VueJS, React) y soluciones .Net. Además escribo en mi propio blog https://blog.imanolnebreda.com.ExperienciaSoftware Development Engineer en Plain Concepts (Ubicación: Madrid, Spain) Plain ConceptsSharepoint Consultant en Novo Nordisk (Ubicación: Copenhague, Dinamarca) NovoNordiskArquitecto de soluciones Sharepoint &amp; O365 en Sogeti (Ubicación: Madrid, Spain) SogetiAnalista Programador en GFI Norte (Ubicación: Bilbao, Euskadi) GFI Norte","author":"Imanol Nebreda"},{"title":"categories","date":"2018-09-30T15:25:30.000Z","updated":"2018-09-30T15:25:30.000Z","comments":true,"path":"categories/index.html","permalink":"https://blog.imanolnebreda.com/categories/","excerpt":"","text":""},{"title":"tags","date":"2018-09-10T16:23:38.000Z","updated":"2018-09-10T16:23:38.000Z","comments":true,"path":"tags/index.html","permalink":"https://blog.imanolnebreda.com/tags/","excerpt":"","text":""}],"posts":[{"title":"Truco del almendruco 3: Mi flujo de SP 2013 no se inicia automáticamente al crear el elemento con otro flujo","slug":"Truco/truco-almendruco-3","date":"2018-05-10T11:47:31.000Z","updated":"2018-05-10T11:47:31.000Z","comments":true,"path":"2018/05/10/Truco/truco-almendruco-3/","link":"","permalink":"https://blog.imanolnebreda.com/2018/05/10/Truco/truco-almendruco-3/","excerpt":"","text":"EscenarioTienes una lista de solicitudes en la que desarrollas un flujo con el motor de flujos de Sharepoint 2013 usando Sharepoint Designer.En este flujo, llega un momento en el que asignas una tarea a un grupo de usuarios.En la solicitud existe un campo de usuarios (“Responsables”) que contiene los usuarios que forman parte del grupo al que se le ha asignado la tarea.Tienes un webpart de lista de tareas en tu página de inicio filtrada para que te muestre tus tareas pendientes, pero, cáspita, no te aparecen las tareas asignadas a tu grupo de usuarios.Te llevas las manos a la cabeza y piensas… ¿Qué hago ahora?Creas un flujo en la lista de tareas, también con el motor de Sharepoint 2013 que:Obtiene el ID de la solicitud del json que hay en el campo “Elementos Relacionados”Copias el contenido de “Responsables” de la solicitud en un campo de usuarios en la tarea de forma que las tareas puedan filtrarse por usuario.Haces la prueba para comprobar que va todo sobre ruedas… y no va. El flujo de la lista de tareas no se ejecuta automáticamente, pero sí manualmente.Aqui es cuando das golpes con la cabeza en la pared y maldices a Sharepoint Designer por enésima vez +1.CausaLa causa de este comportamiento es que la tarea aparece como creada por el flujo de trabajo en nombre de, cuando en realidad, en el fondo, está creada por la cuenta del sistema.El motor de flujos de Sharepoint 2013 se niega rotundamente a ejecutar automáticamente flujos sobre elementos creados por la cuenta del sistema.Solución¿Qué otra opción queda?¡Los flujos del motor de Sharepoint 2010!Estos flujos SÍ se inician automáticamente, por lo que podemos desarrollar nuestro proceso como un flujo de Sharepoint 2010 y ya está.P.D.: Ten en cuenta que los flujos de Sharepoint 2010 no disponen de bastantes acciones y funcionalidades que sí existen en Sharepoint 2013 como fases, obtención del índice de un carácter o texto en una cadena de texto, etc.Este post apareció por primera vez en https://itblogsogeti.com/2018/05/10/truco-del-almendruco-3-mi-flujo-de-sp-2013-no-se-inicia-automaticamente-al-crear-el-elemento-con-otro-flujo/","categories":[{"name":"Truco del almendruco","slug":"Truco-del-almendruco","permalink":"https://blog.imanolnebreda.com/categories/Truco-del-almendruco/"},{"name":"Sharepoint","slug":"Truco-del-almendruco/Sharepoint","permalink":"https://blog.imanolnebreda.com/categories/Truco-del-almendruco/Sharepoint/"},{"name":"Workflow","slug":"Truco-del-almendruco/Sharepoint/Workflow","permalink":"https://blog.imanolnebreda.com/categories/Truco-del-almendruco/Sharepoint/Workflow/"}],"tags":[{"name":"SharePoint","slug":"SharePoint","permalink":"https://blog.imanolnebreda.com/tags/SharePoint/"},{"name":"SharePoint Designer","slug":"SharePoint-Designer","permalink":"https://blog.imanolnebreda.com/tags/SharePoint-Designer/"},{"name":"SharePoint Workflow","slug":"SharePoint-Workflow","permalink":"https://blog.imanolnebreda.com/tags/SharePoint-Workflow/"}]},{"title":"SPO: Error en despliegue en catálogo de aplicaciones","slug":"Sharepoint/SPFx/error-despliegue-catalogo","date":"2018-04-05T13:44:53.000Z","updated":"2018-04-05T13:44:53.000Z","comments":true,"path":"2018/04/05/Sharepoint/SPFx/error-despliegue-catalogo/","link":"","permalink":"https://blog.imanolnebreda.com/2018/04/05/Sharepoint/SPFx/error-despliegue-catalogo/","excerpt":"","text":"Recientemente hemos tenido un problema en un cliente que nos ha dejado un poco perplejos. El escenario es el siguiente: Hace unos meses deplegamos sin problemas en el tenant del cliente un webpart creado con spfx y que se ha estado usando satisfactoriamente. De repente, hace un par de semanas el webpart desapareció de la página en la que estaba (de tipo clásico) y tampoco aparecía en la galería de webparts.Trasteando por internet y yammer, encontramos que bajo ciertas circunstancias, y debido a un bug de la plantilla de yeoman para spfx 1.4.0, los webparts podían no aparecer en la galería al actualizarlos.Por probar, generamos el mismo webpart como un proyecto aparte con la versión actualizada de spfx (1.4.1) que arreglaba este problema.A la hora de desplegar la aplicación en el catálogo de aplicaciones del cliente nos encontramos con que nos daba error. ¡Oh, sorpresa! En nuestros tenants de desarrollo se despliega sin problemas.Revisas el código, los manifiestos, el empaquetado… todo está bien. Te rascas la cabeza. Vuelves a comprobarlo. Vuelves a desplegarlo en el tenant del cliente, y vuelve a dar error. Más rascado de cabeza.Probamos a desplegar la aplicación en dos tenants de producción diferentes y falla en uno de los dos ¡toma ya!¿La diferencia entre ambos tenants? El Office Store estaba desactivado. Activamos el Office Store y volvemos a desplegar la aplicación y ¡funciona!Moraleja: Si tienes problemas de despliegue sin razon aparente, mira el estado del Office StorePD: a día 4 de abril del 2018, el Office Store ya no se llama así, sino “User owned Apps and Services”.Este blog post apareció por primera vez en https://itblogsogeti.com/2018/04/05/spo-error-en-despliegue-en-catalogo-de-aplicaciones/","categories":[{"name":"Sharepoint","slug":"Sharepoint","permalink":"https://blog.imanolnebreda.com/categories/Sharepoint/"},{"name":"SPFx","slug":"Sharepoint/SPFx","permalink":"https://blog.imanolnebreda.com/categories/Sharepoint/SPFx/"}],"tags":[{"name":"SharePoint","slug":"SharePoint","permalink":"https://blog.imanolnebreda.com/tags/SharePoint/"},{"name":"SPFx","slug":"SPFx","permalink":"https://blog.imanolnebreda.com/tags/SPFx/"},{"name":"Sharepoint Online","slug":"Sharepoint-Online","permalink":"https://blog.imanolnebreda.com/tags/Sharepoint-Online/"},{"name":"O365","slug":"O365","permalink":"https://blog.imanolnebreda.com/tags/O365/"},{"name":"App Catalog","slug":"App-Catalog","permalink":"https://blog.imanolnebreda.com/tags/App-Catalog/"}]},{"title":"Truco del almendruco 2: Solucionar error al empaquetar solución con SPFx","slug":"Truco/truco-almendruco-2","date":"2018-01-11T12:47:31.000Z","updated":"2018-01-11T12:47:31.000Z","comments":true,"path":"2018/01/11/Truco/truco-almendruco-2/","link":"","permalink":"https://blog.imanolnebreda.com/2018/01/11/Truco/truco-almendruco-2/","excerpt":"","text":"BienvenidoBienvenido a la segunda parte de la serie de trucos del almendruco, donde aparecen pequeños trucos que nos hacen la vida algo más fácil.EscenarioEstás todo ilusionado haciendo un webpart para Sharepoint 2016/Sharepoint Online, con Sharepoint Framework y React. La pera. El webpart funciona en el workbench local (ejecutando gulp serve) y te propones a empaquetar la solución para su despliegue. Ejecutas gulp build --production y luego gulp package-solucion --production y… explota. No entiendes nada. El error que sale es algo asi:Y piensas… pero si tengo los manifiestos en su sitio y las rutas están bien, ¡qué raro!, y te desesperas porque no eres capaz de solucionarlo.Pruebas a crearte un nuevo proyecto con la plantilla de yeoman, y sin hacer nada más, ejecutas los comandos para empaquetar la solución. Y pasa lo mismo. Aaaahhh, que es un error de la plantilla del proyecto. Uffff. Menos mal.SoluciónLa solución es tan sencilla como olvidarte del primer comando gulp build --production y en su lugar ejecutar gulp bundle --ship.Verás cómo ahora, despues de haber ejecutado este nuevo comando, que en definitiva hace lo mismo, se empaqueta perfectamente la solución y puedes desplegarlo.De nada.Happy Coding!Este blog post apareció por primera vez en https://itblogsogeti.com/2018/01/11/truco-del-almendruco-2-solucionar-error-al-empaquetar-solucion-con-spfx/","categories":[{"name":"Truco del almendruco","slug":"Truco-del-almendruco","permalink":"https://blog.imanolnebreda.com/categories/Truco-del-almendruco/"},{"name":"Sharepoint","slug":"Truco-del-almendruco/Sharepoint","permalink":"https://blog.imanolnebreda.com/categories/Truco-del-almendruco/Sharepoint/"},{"name":"SPFx","slug":"Truco-del-almendruco/Sharepoint/SPFx","permalink":"https://blog.imanolnebreda.com/categories/Truco-del-almendruco/Sharepoint/SPFx/"}],"tags":[{"name":"SharePoint","slug":"SharePoint","permalink":"https://blog.imanolnebreda.com/tags/SharePoint/"},{"name":"SPFx","slug":"SPFx","permalink":"https://blog.imanolnebreda.com/tags/SPFx/"}]},{"title":"Truco del almendruco 1: Inicio condicional de flujos con expresión regular","slug":"Truco/truco-almendruco-1","date":"2017-05-09T11:47:31.000Z","updated":"2017-05-09T11:47:31.000Z","comments":true,"path":"2017/05/09/Truco/truco-almendruco-1/","link":"","permalink":"https://blog.imanolnebreda.com/2017/05/09/Truco/truco-almendruco-1/","excerpt":"","text":"BienvenidoBienvenido al inicio de la serie de trucos del almendruco, donde irán apareciendo pequeños trucos que nos hacen la vida algo más fácil.EscenarioSi has trabajado con Nintex, probablemente sepas que en su producto para Sharepoint 2010 introdujeron el concepto de inicio condicional de flujo, en el que puedes poner ciertas condiciones que si no se cumplen, el flujo no se inicia.Sharepoint Designer no tiene esta característica, así que… ¿Cómo lo hacemos? Fácil, ponemos un If como primer paso, y si no se cumple, paramos el flujo.Ahora bien, supongamos que tenemos varias condiciones y que el flujo no debe correr si se cumple alguna de ellas.SoluciónCon Nintex, podemos fácilmente implementarlo con su interfaz gráfica. En Sharepoint Designer tenemos que usar algún truco que otro. ¿Se te ocurre qué podemos usar? ¡Una expresión regular! Este truco también sirve para Nintex, ya que a veces los inicios condicionales no funcionan tan bien como sería deseable.Supongamos que el flujo no debe correr o iniciarse si alguna de las siguientes condiciones se cumple:Duración es 0 DíasDuración es 0 mesesDuración es 0 años¿Cuál sería nuestra expresión regular?^(0 Días|0 meses|0 años)$“^” indica el inicio de la cadena, “$” indica el final de la cadena, “|” separa los distintos valores a comprobar y los paréntesis agrupan los distintos valores¿Cómo lo interpretamos?Comprueba que el valor pasado coincide exactamente (de principio a fin, incluyendo espacios en blanco)con alguno de los valores de la lista entre paréntesisNota: Fíjate que en la interpretación anterior dice: “incluyendo espacios en blanco”. Esto es extremadamente importante, ya que si dejas un espacio entre la línea vertical y el valor (por ejemplo: “| 0 meses”), ese espacio en blanco se tiene en cuenta y cuando pruebes tu flujo la condición no se cumplirá nunca. Lo mismo ocurre con el paréntesis inicial y el final. ¡No dejes espacios en blanco que no existan en el valor!Se ve así en Sharepoint Designer:Inicio condicional con expresión regular en Sharepoint DesignerEste blog post apareció por primera vez en https://itblogsogeti.com/2017/09/05/truco-del-almendruco-1-inicio-condicional-de-flujos-con-expresion-regular/","categories":[{"name":"Truco del almendruco","slug":"Truco-del-almendruco","permalink":"https://blog.imanolnebreda.com/categories/Truco-del-almendruco/"},{"name":"Sharepoint","slug":"Truco-del-almendruco/Sharepoint","permalink":"https://blog.imanolnebreda.com/categories/Truco-del-almendruco/Sharepoint/"},{"name":"Workflow","slug":"Truco-del-almendruco/Sharepoint/Workflow","permalink":"https://blog.imanolnebreda.com/categories/Truco-del-almendruco/Sharepoint/Workflow/"}],"tags":[{"name":"SharePoint","slug":"SharePoint","permalink":"https://blog.imanolnebreda.com/tags/SharePoint/"},{"name":"SharePoint Designer","slug":"SharePoint-Designer","permalink":"https://blog.imanolnebreda.com/tags/SharePoint-Designer/"},{"name":"SharePoint Workflow","slug":"SharePoint-Workflow","permalink":"https://blog.imanolnebreda.com/tags/SharePoint-Workflow/"}]}]}